#include <iostream>
#include "Header.h"

void printInfo()
{
	printf("----------------------------------------------------------------------------------------------------");
	printf("\n|Антихович Максим Викторович, группа 253505.                                                       |");
	printf("\n|Задание 1. Вариант 4.                                                                             |");
	printf("\n|--------------------------------------------------------------------------------------------------|");
	printf("\n|В справочной автовокзала имеется расписание движения автобусов.                                   |");
	printf("\n|Для каждого рейса указаны его номер, тип автобуса, пункт назначения, время отправления и прибытия.|");
	printf("\n|Вывести информацию о рейсах, которыми можно воспользоваться для прибытия в пункт назначения       |");
	printf("\n|раньше заданного времени(сортировка выбором по убыванию).                                         |");
	printf("\n----------------------------------------------------------------------------------------------------");
}

int intCheck(int min, int max)
{
	int x;
	if (min == 1 && max == 2)
	{
		printf("Хотите продолжить ввод? (1 - Да\t2 - Нет).\nВаш выбор: ");
	}
	if (max == 3) {
		max = 2;
	}
	while (scanf_s("%d", &x) != 1 || x < min || x > max || getchar() != '\n')    //проверка на ввод и ввод числа инт
	{
		printf("Error\n");
		rewind(stdin);
	}
	return x;
}