/*Вычислить значение y в зависимости от выбранной функции f(x), исходя из вашего 
порядкового номера в списке, аргумент определяется из поставленного условия. 
Возможные значения функции f(x): 2x, x^3, x/3 (выбор осуществляется используя 
оператор switch). Предусмотреть вывод сообщений, показывающих, при каком 
условии и с какой функцией производились вычисления y. Разрешено 
использование библиотеки math*/
#include <iostream>
#include <cmath>

int main()
{
	setlocale(LC_ALL, "Russian");
	double a, x, b, z, f, y;
	int n = 0;
	std::cout << "Введите z:\n";
	std::cin >> z;
	std::cout << "Введите a, b:\n";
	std::cin >> a >> b;

	if (z < 1)
	{
		x = pow(z, 3) + 0.2;
		std::cout << "Ваше значение x = z^3 + 0.2\n";
	}

	else
	{
		x = z + log(z);
		std::cout << "Ваше значение x = z + ln(x)\n";
	}
	std::cout << "Выберите номер, соответствующий нужному значению функции f(x):\n" << "1. f(x) = 2x\n" << "2. f(x) = x^3\n" << "3. f(x) = x/3\n";
	std::cin >> n;
	
	switch (n)
	{
	case 1:
		f = 2 * x;
		break;
	case 2:
		f = x * x * x;
		break;
	case 3:
		f = x / 3;
		break;
	default:
		std::cout << "Выберите правильный номер функции ";
			return 0;
	}

	y = 2 * a * pow(cos(x * x), 3) + pow(sin(pow(x, 3)), 2) - b * f;
    std::cout << "Ваше значение y = " << y;

	return 0;
}