//Даны действительные числа a, b, c, x ,y. Выяснить, пройдёт ли кирпич с ребрами a, b, c в прямоугольное отверстие со сторонами x и y. Просовывать кирпич в отверстие разрешается только так, чтобы каждое из его рёбер было параллельно или перпендикулярно каждой из сторон отверстия. Выведите "YES", если кирпич пройдёт, выведите "NO", если не пройдёт. Проверьте правильность входных данных и выведите "Incorrect input" если входные данные некорректны.
#include <iostream>
using namespace std;
int main() {

    float a, b, c, x, y;

    cin >> a >> b >> c >> x >> y;
    if (a <= 0 || b <= 0 || c <= 0 || x <= 0 || y <= 0)
    {
        cout << "Incorrect input" << endl;
    }
    else
    {
        if (x > y)
            swap(a, b);
        if (a > b)
            swap(a, b);
        if (b > c)
            swap(b, c);
        if (a > b)
            swap(a, b);
        if (x >= a && y >= b)
            cout << "YES";
        else
            cout << "NO";
    }
    return 0;
}