#include <iostream>
#include "Header.h"

void printInfo()
{
	printf("<-------------------------------------------------------------------------------------------------------------->");
	printf("\n|Антихович Максим Викторович, группа 253505.                                                                   |");
	printf("\n|Задание 2. Вариант 4.                                                                                         |");
	printf("\n|--------------------------------------------------------------------------------------------------------------|");
	printf("\n|У администратора железнодорожных касс хранится информация о свободных местах в поездах дальнего следования.   |");
	printf("\n|на ближайшую неделю в следующем виде: дата выезда, пункт назначения, время отправления, число свободных мест. |");
	printf("\n|Оргкомитет международной конференции обращается к администратору с просьбой зарезервировать m мест до города N|");
	printf("\n|день недели с временем отправления поезда не позднее t часов вечера. Вывести время отправления или сообщение о|");
	printf("\n|невозможности выполнить заказ в полном объеме.                                                                |");
	printf("\n<-------------------------------------------------------------------------------------------------------------->");
}

int intCheck(int min, int max)
{
	int x;
	if (min == 1 && max == 2)
	{
		printf("Хотите продолжить ввод? (1 - Да\t2 - Нет).\nВаш выбор: ");
	}
	if (max == 3) {
		max = 2;
	}
	while (scanf_s("%d", &x) != 1 || x < min || x > max || getchar() != '\n')
	{
		printf("Error\n");
		rewind(stdin);
	}
	return x;
}