/*≈сть два стола.¬ пр€моугольной комнате W на H стоит пр€моугольный стол
стороны которого параллельны сторонам комнаты.Ќижний левый угол стола
находитс€ в точке(x1, y1), а верхний правый в точке(x2, y2).¬ы хотите поставить
в эту комнату ещЄ один пр€моугольный стол с шириной w и высотой h так, чтобы
сторона, соответствующа€ ширине стола, была параллельна стороне комнаты,
cоответствующей еЄ ширине. (столы могут касатьс€ друг друга, но не могут иметь
    общей площади).
    Ќа какое минимальное рассто€ние нужно сдвинуть первый стол так, чтобы в
    комнату можно было поставить второй стол ? ѕоворачивать столы -
    запрещено.¬ расчЄтах используетс€ ƒекартова(от –ене ƒекарт) система
    координат*/
#include <iostream>
using namespace std;
int main()
{
    long double W, H, x1, y1, x2, y2, w, h, r1, r2, r3, r4;
    cin >> W >> H >> x1 >> y1 >> x2 >> y2 >> w >> h;
    if (w <= W && h <= H)
    {
        if (w <= x1 || h <= y1 || h <= H - y2 || w <= W - x2) cout << 0 << endl;

        else if (w + (x2 - x1) <= W || h + (y2 - y1) <= H)
        {
            r1 = w - x1;
            if (r1 < 0) r1 = r1 * (-1);
            r2 = w + x2 - W;
            if (r2 < 0) r2 = r2 * (-1);
            r3 = y2 - y1 - h;
            if (r3 < 0) r3 = r3 * (-1);
            r4 = h - (H - y2);
            if (r4 < 0) r4 = r4 * (-1);

            if (w == W)
            {

                if (r3 <= r4)
                {
                    if (r3 + h <= H) cout << r3 << endl;
                }
                else if (r4 <= r3)
                {
                    if (r4 + h <= H) cout << r4 << endl;
                }
            }

            if (h == H)
            {
                if (r1 <= r2)
                {
                    if (r1 + w <= W) cout << r1 << endl;
                }
                else if (r2 <= r1)
                {
                    if (r2 + w <= W) cout << r2 << endl;
                }

            }
            else if (w != W && h != H)
            {
                if (r1 <= r2 && r1 <= r3 && r1 <= r4)
                {
                    if (r1 + w <= W)
                    {
                        cout << r1 << endl;
                        exit(0);
                    }
                }
                else if (r2 <= r1 && r2 <= r3 && r2 <= r4)
                {
                    if (r2 + w <= W)
                    {
                        cout << r2 << endl;
                        exit(0);
                    }
                }
                else if (r3 <= r1 && r3 <= r2 && r3 <= r4)
                {
                    if (r3 + h <= H)
                    {

                        cout << r3 << endl;
                        exit(0);
                    }
                }
                else if (r4 <= r1 && r4 <= r2 && r4 <= r3)
                {
                    if (r4 + h <= H)
                    {
                        cout << r4 << endl;
                        exit(0);
                    }
                }
            }

        }

        else cout << -1 << endl;
    }
    else cout << -1 << endl;
    return 0;
}