/*Определить, попадает ли круг с точкой в центре которая имеет координату M1(x1, 
y1) и радиусом r в круг с точкой в центре которая имеет координату M2(x2, y2) и 
радиусом R. Если круг M1 попадает в круг M2, вывести сообщение “Да”. Если круг 
M2 попадает в круг M1 вывести сообщение “Да, но справедливо обратное для 
двух фигур”. Если круги пересекаются, но не поглощают друг друга, то вывести 
сообщение “Фигуры пересекаются”. Иначе вывести сообщение “Ни одно условие 
не выполнено”.*/
#include<iostream>
#include<cmath>
int main()
{
	setlocale(LC_ALL, "Russian");
	double x1, y1, r, x2, y2, R, d;

	std::cout << "Введите координаты точки в центре первого круга:\n" << "x1 = ";
	std::cin >> x1;

	std::cout << "y1 = ";
	std::cin >> y1;

    std::cout << "Введите радиус первого круга:\n" << "r = ";
	std::cin >> r;

	std::cout << "Введите координаты точки в центре второго круга:\n" << "x2 = ";
	std::cin >> x2;

	std::cout << "y2 = ";
	std::cin >> y2;

	std::cout << "Введите радиус второго круга:\n" << "R = ";
	std::cin >> R;

	d = sqrt((x1 - x2) * (x1 - x2) + (y1 - y2) * (y1 - y2));

	if (r <= 0 || R <= 0)
	{
		std::cout << "Введите корректное значения радиуса";
		return 0;
	}

	if (x1 == x2 && y1 == y2 && r == R)
	{
		std::cout << "Ни одно условие не выполнено";
		return 0;
	}
	
	if (d > R + r)
	{
		std::cout << "Ни одно условие не выполнено";
	}

	else if (r + R >= d)
	{

		if (R >= r + d)
		{
			std::cout << "Да";
		}

		else if (r >= R + d)
		{
			std::cout << "Да, но справедливо обратное для двух фигур";
		}

		else
		{
			std::cout << "Фигуры пересекаются";
		}
	}
	return 0;

}